[
    {
        "title": "How to Cook Pasta?",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "JANUARY 9TH 2018",
        "dateNum": "09",
        "dateMonth": "JANUARY",
        "img": "https://i.ibb.co/WxqLRvH/New-Project-3.png",
        "description": "This simple pasta recipe shows the technique for any pasta dish. This is a foundation recipe and with bottom up cooking the strong foundation leads to a high quality end-dish.",
        "secondPera": "Bottom-up cooking is the basis for any great meal. In this article you will learn the basics of how to cook spaghetti pasta – but this process can be applied to any pasta recipe. This simple step is the foundation to any other more elaborate pasta recipe and the good news is it is very easy! When learning how to cook pasta spaghetti is a classic that goes with anything, can be used as a main course, as a side or can be enjoyed with grated parmesan cheese, fresh basil pesto, with marinara sauce or as a side paired with a protein.",
        "thirdPera": "Place a pot over the burner on high heat. Fill the pot until there is 1 inch of room to the top of the pot (when we add the pasta this will prevent the water from overflowing.) Remember – lots of water makes for better tasting pasta. Add 1tsb salt to the water. This improve flavor and makes the water boil faster.",
        "forthPera": "When you see the water is boiling, (when bubbles surface) add the pasta. Submerge half of the pasta, then when it gets soft push the rest of the pasta down. You do not need to do this with short pasta. Just with long noodles like linguine, or spaghetti. Tips: make sure to pasta not sticking out of the water, will not cook and stay dry. Set the timer to 10 minutes. To make the pasta al-dente or “to the tooth” in Italian make sure you don’t let the pasta get too soggy. You want the pasta to be a slightly harder texture.",
        "fifthPera": "Strain the pasta through strainer on the sink. At this point, you can add grated parmesan cheese, squirt fresh lemon, fine chopped parsley and olive oil, or any other topping to serve.",
        "sixthPera": "Enjoy this pasta recipe with grated parmesan cheese, with a sauce like marinara, a fresh basil pesto sauce, or add a protein of choice."
    },
    {
        "title": "Smash Burgers at Home.",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "MARCH 25TH 2020",
        "dateNum": "25",
        "dateMonth": "MARCH",
        "img": "https://i.ibb.co/sPYfpWC/New-Project-5.png",
        "description": "Smash burgers are arguably one of the best ways to prepare a burger, and their rising popularity is a testament to their quality. Restaurant chains that specialize in them are growing rapidly (the style seems to have emerged in the Great Lakes region, but documentation on that is sketchy). And it is no wonder, because they are good.",
        "secondPera": "Now, it is true that you can’t cook them directly on a grill, but that doesn’t mean you can’t have them for your celebratory cookout. Just take your cast iron out to the grill and cook in the fresh air. Of course, you will need to temp your burgers to make sure they’re done perfectly, but with a fast and accurate thermometer, that’s no problem. Let’s take a look.",
        "thirdPera": "A smash burger, for those that don’t know, is a hamburger, usually with cheese, that is made with very thin beef patties (made thin by pressing on the cooking surface) that have been cooked on a griddle or flat top.",
        "forthPera": "You may be wondering why this version of a burger gets its own name. That’s a fair question, and one with an easy answer. When griddle cooking thin patties like these, you end up with a larger proportion of tasty, crusty Maillard browning per patty than you would get from thicker, meatier burgers. And if you’re making cheeseburgers, it’s also a higher proportion of cheese to meat. Add to those tastier proportions a drastically reduced cooking time, and you’ve got yourself a real contender for best burger.",
        "fifthPera": "First, you need the right meat. 80/20 chuck is pretty much perfect for smash burgers. The higher fat content helps ensure juiciness, and the chuck just tastes good.",
        "sixthPera": "To make a smash burger, start with a ball of ground beef that is just larger than the size of a golf ball (about 2 ounces is just right). Season each ball with salt and pepper, and set them on a hot cast-iron griddle. As soon as they’re in the pan, smash them flat with a firm spatula, pressing down on its surface with a rolling pin or some other sturdy object. Cook just until the crust forms on one side, then flip and finish the patties to a food-safety temp of 160°F (71°C).",
        "seventhPera": "Many people have learned that it’s not good to press down on your burgers while they cook, because doing so expels juices from them. Smashing them flat and thin then sounds like a recipe for dry, gross burgers. Not so! As Kenji has shown, it’s exceedingly hard to press juices out of uncooked meat. It’s only once the proteins start to coagulate and the fats start to render that the juice gets loose inside a patty. If you smash your burgers right when you put them in the pan, they’ll cook as if they had always been that shape and won’t experience any extra juice loss.",
        "eightPera": "I love making these amazing burgers at home. The flavor is unbeatable and they take so little time to make. Cooking them outside so I don’t have to degrease my stove and countertops is even better! Give them a try this weekend with your Thermapen to guide you and you’ll love the results you get. Smash those burgers!"
    },
    {
        "title": "French Fries Recipe.",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "DECEMBER 2TH 2022",
        "dateNum": "02",
        "dateMonth": "DECEMBER",
        "img": "https://i.ibb.co/hmV9n3F/New-Project-1.png",
        "description": "I'm gonna come right out and say something that I'm sure you won't all openly agree with: McDonald's french fries are great. At their best, they are everything a french fry should be: salty, crisp, light, and not greasy. Granted, you get the occasional odd franchise that lets' em sit under the heat lamp for a couple hours too long, but on the whole, I find it remarkable that the bigwigs have discovered a way to create a frozen fry that comes out virtually identically, regardless of who is working that fry station.",
        "secondPera": "To be absolutely honest, I've never been able to make fries as good as theirs (shhhhh!). Sure, my thick-cut pub-style fries are super-potatoey and fantastic, and when I'm in the mood for them, my seasoned steak fries can't be beat, but for thin, super-crisp fries (I'm talking the kind that only appear in fast food restaurants and French bistros under the name frites)? I'm always better off running down to the take-out window than bothering to fry them myself at home.",
        "thirdPera": "I've been literally giddy with the quality of the fries that have been coming out of my kitchen for the last two days. My wife won't hear the end of it. Even my puppy is wondering why his owner keeps exclaiming. Every half hour from the kitchen. I've cooked over 43 batches of fries in the last three days, and I'm happy to report that I've finally found a way to consistently reach crisp, golden bliss.",
        "forthPera": "In order to achieve this crispness, the surface structure of a fry must be riddled with micro-bubbles. It's these tiny crisp bubbles that increase the surface area of the fry, making it extra crunchy. Ideally, this layer should only be as thick as it needs to be to add crispness. Any thicker, and you start running into leathery territory.",
        "fifthPera": "Fries with a pasty, mealy, or gummy interior or even worse, the dreaded state known as 'hollow-fry' (when the interior is missing entirely) are an automatic fail in my fry book.",
        "sixthPera": "Fries that are too dark or are spotty have an off putting burnt flavor that distracts from the potato. Light golden but perfectly crisp is how I want my fries to be.",
        "seventhPera": "Fries that comes straight out of the fryer are almost always perfectly crisp. The true test of a great fry is whether or not it remains crisp and edible a few minutes later after its been sitting on your plate. The bendy fry pictured above fails that test. So how does one going about achieving these goals? The traditional double fry method (once at low temp, then again at high temp) works, but it's far from foolproof, and fails to meet all of the requirements I've set for a perfect fry. For one thing, the fries inevitably come out too brown—some times massively so. For another, they lose their crunch within a few minutes after coming out of the fryer. Clearly the method needs an overhaul. I suppose I could do what the McDonald's Corporation did and spend millions of dollars researching exactly how to accomplish fry perfection time after time anywhere around the world, but unfortunately Serious Eats doesn't pay me well enough to do that. I'm also understaffed, to say the least. So I decided to go with the next best alternative: steal their recipe.",
        "eightPera": "The improvement was undeniable. The frozen fries had a distinctly fluffier interior, while the unfrozen ones were still ever-so-slightly gummy. It makes perfect sense. Freezing the potatoes causes their moisture to convert to ice, forming sharp, jagged crystals. These crystals damage the cell structure of the potato, making it easier for them to be released once they are heated and convert to steam. The best part? Because freezing actually improves them, I can do the initial blanching and frying steps in large batches, freeze them, and have a constant supply of ready-to-fry potatoes right in my freezer just like Ronald himself!"
    },
    {
        "title": "Thai Chicken Curry Recipe.",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "DECEMBER 2TH 2022",
        "dateNum": "02",
        "dateMonth": "DECEMBER",
        "img": "https://i.ibb.co/WxqLRvH/New-Project-3.png",
        "description": "Thai Chicken Curry with coconut milk and vegetables is a one-pot meal that is healthy, lusciously creamy and incredibly easy to make. This Thai Curry is made with thin slices of chicken, red curry paste, fresh herbs and lots of veggies that can be customized to your taste!",
        "secondPera": "Whether they are authentic Thai or Thai-style recipes, one thing is certain, we love them all! Some of our favorite Thai dinner recipes are Thai Basil Chicken, Shrimp Pad Thai and this Tom Yum Soup.",
        "thirdPera": "Thai Coconut curry is one of my go-to-meals for weeknight meals and for when I have company. This easy one-pot wonder is loaded with lean protein, crisp tender veggies and healthy fats from coconut milk. This is how this amazing recipe looks coming off the pot! .",
        "forthPera": "Thai curries are incredibly flavorful and this recipe makes a savory, spicy and rich dish with lots of umami, You can taste the coconut milk and the freshness of the lemongrass comes through in every bite.",
        "fifthPera": "Thai Red Curry Paste: There are many brands on the market and although I’ve been using Mae Ploy Red Curry Paste for years, Maesri as well as Thai Kitchen are also great options.",
        "sixthPera": "Coconut Milk: I highly recommend you make this Thai red curry recipe with full-fat coconut milk in order to have a thick, luscious, rich consistency and silky texture. You won’t need to use any thickeners I promise! Chaokoh is the one I use the most as well as this one. Both brands are from Thailand. There are many others good ones including organic ones.",
        "seventhPera": "Chicken: I chose boneless and skinless chicken breast cut thinly into bite size pieces. Chicken thighs as well as other proteins can be used.",
        "eightPera": "Chicken: I chose boneless and skinless chicken breast cut thinly into bite size pieces. Chicken thighs as well as other proteins can be used."
    },
    {
        "title": "chicken biryani Recipe.",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "DECEMBER 2TH 2022",
        "dateNum": "02",
        "dateMonth": "DECEMBER",
        "img": "https://i.ibb.co/FXKNPNP/New-Project-4.png",
        "description": "Biryani in India doesn't just mean biryani. There are variations across the length and breadth of the country. There is Hyderabadi biryani (which is what I'm sharing today) where the biryani has a lot of gravy or masala and is cooked slowly with rice in a sealed pot. Then there is the Muslim wedding biryani which actually has lesser masala, but packed with flavour mostly from whole spices; the Kerala biryani, donne biryani from Karnataka and so many more.",
        "secondPera": "In every single form, biryani is delicious and is almost like a one pot meal that's enjoyed by families and eaten together - like a celebration!",
        "thirdPera": "But I have to be a 100% honest with you. I had never made chicken biryani before I decided to share this recipe. And I got convinced because so so many of you have requested for a legit/authentic biryani recipe that was also relatively easy.",
        "forthPera": "And we are biryani lovers. Mostly mutton biryani, but this chicken biryani really changed our mind. The first time I attempted it, I was nervous, because it seemed so difficult and daunting and it looked like there were a gazillion steps. So I took a deep breath and decided to break them down for you Planning on making Biryani? Here are 19 Tips to make the Best Biryani Ever!",
        "fifthPera": "Chicken: I only like to use thighs and drumsticks for chicken biryani because they remain juicy and don't overcook through the long cooking time. For me, chicken breast is a big no no as it will dry out and will just be rubbery.",
        "sixthPera": "Yogurt: Greek yogurt, plain yogurt or homemade curd/dahi works well. Acts as a tenderiser and add some tanginess to the masalaFried Onions: Also called birista, I've outlined the process to make fried onions at home below. But these days, packages fried onions are easily available and are more convenient option. To store a large amount of fried onions, place them in an airtight container and freeze them for later",
        "seventhPera": "Fried onions are a key ingredient here, and it’s important to get this right. Onions are cut into slices and then browned on medium flame in oil. They don't need to be extra crispy, but onions should be a deep golden brown without getting burnt. You can also use store bought fried onions which are easily available in supermarkets these days.",
        "eightPera": "While choosing rice for the biryani, make sure to buy 'basmati rice' and not long grain rice. While they may look similar at first, good quality basmati rice is fragrant, and has grains that are thin and long as opposed to long grain rice which has fatter grains and almost no fragrance. The basmati rice is cooked for exactly 5 minutes in boiling water with whole spices and salt to get it to the right doneness - which is 70%. Drain the rice well to get rid of any excess water. The rice will continue to steam when we finally cook it along with the chicken and that's where it picks all the flavour and perfume from the chicken, saffron, mint leaves and coriander."
    }
]