[
    {
        "title": "AKMEL NURI NOVEMBER 2017",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "JANUARY 9TH 2018",
        "dateNum": "09",
        "dateMonth": "JANUARY",
        "img": "https://i.ibb.co/TbFwstL/blog6.jpg",
        "description": "The last time we visited Akmel’s organic farm in Limu, Ethiopia, was in November 2016. At that time we were focusing on improving the picking and sorting of the coffee cherries. To assist us in this project we invited our good friend from El Salvador, Rodolfo Ruffatti. Rodolfo has been producing some of the most interesting natural coffees to come out of El Salvador in the last couple of years. We couldn’t think of anyone better to help guide the good people at Akmel’s farm.",
        "secondPera": "To get started we went through the sorting process at the raised drying beds together with farm manager Befekadu and the regular workers. Rodolfo was telling them how important it is to remove any cherries that were not perfectly ripe. If you have never seen the end result of the coffee you are creating at farm level, it is very hard to know how important this step is! To make this clearer, we brought back some of Akmel’s coffee that we had roasted. It was easy for everyone to see the difference in colour of the roasted beans and that we needed to improve the sorting.",
        "thirdPera": "After this we went out in the fields and picked coffee with a small group of pickers. Here we could show what quality we were looking for, regarding ripeness and colour of the cherries. These pickers went on to collect a full bucket of all the four single varieties Akmel is growing in large scale at the farm. The varieties are 74-110, 74-142, 74-165 and 74-40.",
        "forthPera": "Once they had collected their full bucket, we collected all the coffee cherries at the drying tables. The improvement in picking was absolutely astonishing and we could now do proper tests where we dried these single varieties separately. This gave us a clear idea of how the varieties differentiate from one another.",
        "fifthPera": "As I’m writing this we are in late November 2017. We are at the very beginning of the harvest and back at Akmel’s farm. The improvement in taste quality from last year’s work has been great and furthermore we now know which varieties we prefer. We have been looking forward to being able to give this feedback to all of Akmel’s employees.",
        "sixthPera": "The farm looks healthier than ever and there are plenty of ripe coffee cherries ready to be picked.",
        "seventhPera": "Together with Akmel, we have been going through all the improvements from last year. It’s been exciting to tell the staff how pleased we have been with the great job they have done by significantly improving the quality. At the same time we are also highlighting the importance in keeping focused on the quality, with the ultimate goal of creating a natural coffee as clean as a washed coffee.",
        "eightPera": "This focus will not only be getting us a better tasting coffee. It will also result in less wasted coffee as unripe cherries are now not getting picked, rather, they are left to fully ripen which results in a larger total harvest."
    },
    {
        "title": "INTRODUCING KRISTEN BERNIKOWS GADE",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "MARCH 25TH 2020",
        "dateNum": "25",
        "dateMonth": "MARCH",
        "img": "https://i.ibb.co/nkXN63y/blog5.jpg",
        "description": "A bright red door beckons you from the busy city streets, and once inside you are blanketed by the smell of coffee and the sound of Billie Holliday echoing throughout the space. The walls are painted a muted dark-blue and the candles are always burning. You scope out that perfect corner to catch up with a friend or read the daily newspaper.",
        "secondPera": "The mismatch chairs and lamps fit effortlessly in the space and the old photographs, that once adorned the walls of the smokey bar that opened in 1933, are still hanging. As you make your way up to the bar, youare greeted by an attentive barista who wants to tell you more about the variety of options on the menu. You are offered a taste of the nitro kaffe kombucha, and after one sip, every area of your tongue is stimulated. It is alive and sparkling, sweet and sour, bitter but balanced.",
        "thirdPera": "The old wooden fish that once hung inside the bodega is now used to showcase the range of alcoholic drinks offered here. After considering all options, you decide to enjoy one of the black coffees. The warmth of the space invites you to sit down–even though you have work in twenty minutes– and fill your cup to the brim with a juicy, Kenyan hand-brew. Whether you have two minutes or two hours, we invite you to come find your place inside our new bar on Kristen Bernikows Gade. Just look for the bright red door."
    },
    {
        "title": "Origin trip to Kenya",
        "comment": "Comments Are Off For This Post.",
        "creator": "Admin",
        "date": "DECEMBER 2TH 2022",
        "dateNum": "02",
        "dateMonth": "DECEMBER",
        "img": "https://i.ibb.co/dLn3tL5/blog-5.jpg",
        "description": "In November I, Jacob Salomonsen, got to join co-founder Klaus Thomsen on his second trip to Kenya of 2017. In the following I have tried to gather my thoughts on key topics from this particular trip.",
        "secondPera": "More thorough descriptions on wet processing, varieties or how our Direct Trade works in Kenya can be found in previous blog posts. We also posted all photos from this trip on our Flickr page.",
        "thirdPera": "The drive from Nairobi to the Nyeri region only takes a few hours but the change in landscape is dramatic. Suddenly the terrain becomes hilly and houses emerge sporadically on the ridges where vegetation is less dense. Most people here are farmers growing several crops such as maize, beans, potatoes, tea and coffee.",
        "forthPera": "The coffee fields are often visible from the road and while these were the first coffee trees I had ever seen, the mere abundance made your eyes adjust to the scenery rather quickly. This made room for new impressions like the occasional whiff of fresh coffee cherries being depulped as we got closer to one of our main stops on the trip: Kieni",
        "fifthPera": "We have visited and bought from the Kieni factory for 8 years now. One of the reasons for paying a visit in November is that the main harvest is at its peak. It is the perfect time to witness how fresh cherries are processed and just how much attention it requires during all stages. This includes adjusting the depulper according to cherry size and assessing the amount of remaining mucilage (a sugary layer on the beans) during fermentation. The latter is a critical stage which is purely assessed by hand despite being very dependant on weather conditions.",
        "sixthPera": "Charles (chairman, board member of Mugaga Society) and Josphat (Kieni mill manager) are very skilled at making the right calls at the right time but also open to discuss how to keep improving quality. This time we discussed the benefits of acquiring a moisture meter to monitor when the coffee has dried sufficiently and the pace at which it is doing so. This is commonly done by biting into a bean or shaking a handful using sound cues to indicate the moisture content.",
        "seventhPera": "Charles (chairman, board member of Mugaga Society) and Josphat (Kieni mill manager) are very skilled at making the right calls at the right time but also open to discuss how to keep improving quality. This time we discussed the benefits of acquiring a moisture meter to monitor when the coffee has dried sufficiently and the pace at which it is doing so. This is commonly done by biting into a bean or shaking a handful using sound cues to indicate the moisture content."
    }
]